;reboot()
reboot:
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ; メッセージを表示
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        cdecl   puts, .s0                               ; //再起動メッセージを表示

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ; キー入力待ち
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
.10L:
;                                                       ; do
        mov     ah , 0x10                               ; {
        int     0x16                                    ;   // キー入力待ち
;                                                       ;   AL=BIOS(0x16,0x10);
        cmp     al , ' '                                ;   ZF = AL == ' ';
        jne     .10L                                    ; } while(!ZF)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ; 改行を出力
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        cdecl   puts, .s1                               ; //改行

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ; 再起動
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        int     0x19                                    ; BIOS(0x19); //reboot()

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ; 文字列データ
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
.s0 db 0x0A, 0x0D, "Push SPACE Key to Reboot...", 0     ;
.s1 db 0x0A, 0x0D, 0x0A, 0x0D, 0                        ;

; (関数の概要(コンピューターを再起動する関数です))
; 1. "cdecl puts,.s0" 突然再起動されたらビックリするので再起動をする旨を伝えます
; 2. "10L" もしスペースキーが押下されたら再起動ができるように繰り返しを行います"mov ah,0x10"
;    は拡張キーボード用です
;   | int 0x16 | |      AH      | |      AL      |
;   |^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
;   |    入力   | |     0x00     |       ---      |
;   |    出力   | | スキャンコード |   アスキーコード  |
; 3. "cdecl puts,.s1" 改行を出力します
; 4. "int 0x19" 再起動をするBIOSコールを発行します
; 5. ".s0" ".s1" 表示する文字列をそれぞれ定義しています
